{
  "holiday": [
    {
      "date": "21-02",
      "day": "Monday",
      "holiday": "International Mother Language day",
      "type": "Notional holiday",
      "comment": "21st February is a red-letter day in the history of our nation. It is also a mourning day for us. It is a day of historical importance. The day reminds us of our language movement and the sacrifice of our heroic sons. Now we observe the day every day as international mother language day, formerly regarded as saheed dish. The day is a national holiday. UNESCO declared the day as international mother language day in November 1999. It is not observed in our country but also regarded as an international mother language day worldwide. On the day in 1952, the Pakistani wanted to impose their undue language as our state language. They tried to take away our mother tongue. Then our heroic sons of Bangladesh established the Bangla language as the state language sacrificing their blood and lives. On the day. We pay homage to the shaheed minar with flowers to show respect for their sacrifice. We bow down our heads singing a traditional song, \"Amar vai er route rangano ekuse February, ami ki vulte pari.\" All Government and Government organizations bring out rallies very early in the morning singing song; they go to shaheed miner. All classes of people go to shaheed minar with flowers to show respect to the language martyrs. So the day and language martyrs will be remembered forever in the history of our Bengali nation.",
      "url": "https://today.thefinancialexpress.com.bd/uploads/1550599200.jpg"
    },
    {
      "date": "17-03",
      "day": "Thursday",
      "holiday": "Birthday of Bangabandhu Sheikh Mujibur Rahman",
      "type": "Notional holiday",
      "comment": "The father of the nation Bangabandhu Sheikh Mujibur Rahman is the architect of independent Bangladesh.He is recognized as the greatest Bengali of the past Thousand Years.We owe to his charismatic leadership for making us a free nation.This great leader was born on 17th March 1920 at Tungipara in Gopalganj.His father's name was Sheikh lutfur Rahman and mother's name was Sayera Khatun.He passed the matriculation examination from the Gopalganj Mission High School.He obtained B.A. degree in 1947 from the Kolkata Islamic college.Afterwards, he joined the politics and did his best for the Bengali Nation to make them free from the misrule and oppression of the pak rulers .His history address on the 17th March 1971, ata mammoth gathering at the Race Course marked a turning point in the history of the Bengali Nation.In his address he made a clarion call, saying: \" Build forts in each homestead.You must resist the Pakistani army with whatever you have in hand. Remember: since we have alreday had to shed blood , we will have to shed a lot more of it. By the grace of Allah we will be able to liberate the people of this land. The struggle this time is a struggle for freedom__ the struggle this time is a struggle for emancipation. He was arrested at 25 March, 1971 and was taken to Pakistan.He was sent back home after Liberation. He was the Prime Minister and sometime President of Bangladesh but unfortunately he was assassinated by some misguided Army officers on 15th August, 1975 ,along with most of his family members excepting for his two daughters. It is considered a great loss for the nation. Nothing can compensate the loss. He was engraved at Tungipara.",
      "url": "https://bangladeshpost.net/webroot/uploads/featureimage/2020-09/5f6f036adddfd.jpg"
    },
    {
      "date": "19-03",
      "day": "Saturday",
      "holiday": "Shab-e-Barat",
      "type": "Government holiday",
      "comment": "Shab-e-Barat is an Islamic festival celebrated on the night of the 14th of Shahan every year to mark Prophet Mohammad’s ascent to heaven. Muslims believe that on this day God writes the destiny of all men for the coming year.\n\nMuslims celebrate it with merry-making, illuminations and fireworks. Sweets, especially sevvaiyan (vermicelli), are sent to the houses of friends and relatives. `Fateha’ or blessings are recited over food in the name of Prophet, his daughter Fatimah and his son-in-law Ali. The Holy Quran is read out by the people.\n\nOn this occasion the mosques are elaborately decorated and people throng to the mosque to listen to the sermons of Ulema, highlighting the importance of night. A large number of people visit the graveyards to seek Allah’s blessings for the deceased. A number of shrines also buzz with devotees who lay floral wreaths and offer Fateha. Thousands of beggars also throng the graveyards of the city, seeking alms.",
      "url": "https://cdn.risingbd.com/media/imgAll/2021March/en/Shabebarat-2103231147.jpg"
    },
    {
      "date": "14-04",
      "day": "Thursday",
      "holiday": "Pahela Baishakh",
      "type": "Notional holiday",
      "comment": "The first day of Bangla New Year is Pahela Baishakh. It is one of the most popular public celebrations in the life of Bangladeshis. -this day bears a special significance to us. Every year this day of cultural and traditional heritage is celebrated all over the country with enthusiasm and funfair. It is a unique and distinctive festival to the people of all classes and communities in Bangladesh. The day is a public holiday. The day has appealed to both the rural and urban areas. On this day the shopkeepers open their new accounts book and celebrate it through arranging Halkhata festival. They invite their customers and clients and offer sweets and other food. t-17:- customers pay all dues they left out throughout the day. The village people also arrange Baishakhi Mela in different places. These Melas become their meeting places. The village people of all classes enjoy them \\:. erg much. In the capital city, the day opens with the celebration of Chhayanzit, a leading cultural organization. Besides. Bangla Academy, National Museum, National Press Club, etc. arrange meetings and seminars, The tine Arts Institution of Dhaka University brings out a colorful procession wearing various masks. They welcome the day in a very gorgeous way.. Various mass media give coverage to the significance of the day. Bangladesh Television and Bangladesh Betar put out special programs. Thus the day is a national day and comes to the life of every Bangladeshi with pleasure and happiness.",
      "url": "https://cdn.jagonews24.com/media/imgAllNew/BG/2019November/pahela-baishakh-b-20200401141959.jpg"
    },
    {
      "date": "29-04",
      "day": "Sunday",
      "holiday": "May Day",
      "type": "Notional holiday",
      "comment": "May Day is an international day. It is a very glorious day in the history of the labourers. The 1st day of May is observed as May Day. The day is observed to show respect to the demands of the labourers. The history of the day is somewhat sorrowful. On the 3rd May in 1886 some labourers gathered to meet some of their demands. The demands were minimum wage, safety laws and 8 hours work day. The spot was MC Comic Harvest Machine Company, Chicago. The police fired on the stricker. As a result, one was killed and some were wounded seriously. Then their demands were granted. But at the beginning of the industrial revolution, there was not timeable for the workers. They had to work for a long time at day and night. It was really very inhumane. So, the strike of the workers was very justified. Therefore, May Day is very important for all the workers. The day is a holiday for the workers. The day is observed in the whole work., They celebrate the day by holding processions, meeting, seminars, milad etc.",
      "url": "https://i.ndtvimg.com/i/2018-05/may-day_650x400_51525146828.jpg"
    },
    {
      "date": "02-05",
      "day": "Monday",
      "holiday": "Eid-ul-Fitr",
      "type": "Notional holiday",
      "comment": "Eid al-Fitr is a Muslim holiday that marks the end of Ramadan, the Islamic holy month of fasting (sawm). Eid is an Arabic word meaning \"festivity\", while Fiṭr means \"to break fast\"; and so the holiday symbolizes the breaking of the fasting period. It is celebrated after the end of the Islamic month of Ramadan, on the first day of Shawwal.\n\nEid al-Fitr is sometimes also known as the \"Smaller Eid\" as compared to the Eid al-Adha that lasts three days following the Hajj (the pilgrimage to Mecca) and is casually referred to as the \"Greater Eid\"\n\nAt the end of Ramadan every Muslim is required to pay Zakat al-Fitr (a special fast breaking alm) as a token of thankfulness to God for having enabled him or her to observe the obligatory fast.\n\nTypically, on the day of the al eid Muslims generally greet each other have a small breakfast before attending a special Eid prayer that is performed in congregation at mosques or open areas like fields, squares etc. Muslims are encouraged to dress in their best clothes (new if possible) for the occasion.",
      "url": "https://www.thestatesman.com/wp-content/uploads/2020/05/eid.jpg"
    },
    {
      "date": "03-05",
      "day": "Tuesday",
      "holiday": "Eid-ul-Fitr",
      "type": "Notional holiday",
      "comment": "Eid al-Fitr is a Muslim holiday that marks the end of Ramadan, the Islamic holy month of fasting (sawm). Eid is an Arabic word meaning \"festivity\", while Fiṭr means \"to break fast\"; and so the holiday symbolizes the breaking of the fasting period. It is celebrated after the end of the Islamic month of Ramadan, on the first day of Shawwal.\n\nEid al-Fitr is sometimes also known as the \"Smaller Eid\" as compared to the Eid al-Adha that lasts three days following the Hajj (the pilgrimage to Mecca) and is casually referred to as the \"Greater Eid\"\n\nAt the end of Ramadan every Muslim is required to pay Zakat al-Fitr (a special fast breaking alm) as a token of thankfulness to God for having enabled him or her to observe the obligatory fast.\n\nTypically, on the day of the al eid Muslims generally greet each other have a small breakfast before attending a special Eid prayer that is performed in congregation at mosques or open areas like fields, squares etc. Muslims are encouraged to dress in their best clothes (new if possible) for the occasion.",
      "url": "https://www.thestatesman.com/wp-content/uploads/2020/05/eid.jpg"
    },
    {
      "date": "04-05",
      "day": "Wednesday",
      "holiday": "Eid-ul-Fitr",
      "type": "Notional holiday",
      "comment": "Eid al-Fitr is a Muslim holiday that marks the end of Ramadan, the Islamic holy month of fasting (sawm). Eid is an Arabic word meaning \"festivity\", while Fiṭr means \"to break fast\"; and so the holiday symbolizes the breaking of the fasting period. It is celebrated after the end of the Islamic month of Ramadan, on the first day of Shawwal.\n\nEid al-Fitr is sometimes also known as the \"Smaller Eid\" as compared to the Eid al-Adha that lasts three days following the Hajj (the pilgrimage to Mecca) and is casually referred to as the \"Greater Eid\"\n\nAt the end of Ramadan every Muslim is required to pay Zakat al-Fitr (a special fast breaking alm) as a token of thankfulness to God for having enabled him or her to observe the obligatory fast.\n\nTypically, on the day of the al eid Muslims generally greet each other have a small breakfast before attending a special Eid prayer that is performed in congregation at mosques or open areas like fields, squares etc. Muslims are encouraged to dress in their best clothes (new if possible) for the occasion.",
      "url": "https://www.thestatesman.com/wp-content/uploads/2020/05/eid.jpg"
    },
    {
      "date": "15-05",
      "day": "Sunday",
      "holiday": "Buddha Purnima",
      "type": "Notional holiday",
      "comment": "Buddha Purnima is referred to as Buddha Jayanti. It is one of the most crucial festivals in India and celebrated to memorize Buddha’s enlightenment. Thus, according to the Hindu calendar, it is celebrated in the month of May. It is celebrated throughout Asian countries. Buddha Purnima is the holy time for Buddhist people. In India, it is known as Vaisakha Pooja. Buddha Purnima is a remarkable day for Buddhists. In India, it is the important festival as he lived in India. Many religious activities are practiced at this festival. Devotees of Buddhism celebrate Buddha Purnima with great devotion all over the world. Prince Siddhartha is the ninth incarnation of Lord Vishnu for all the devotees.\n\nThe celebration of Buddha Purnima is a holiday in India. In the northern states, the Buddha Purnima is celebrated well. Devotees wear white clothes and go to Lord Buddha temples. Also, they prepare ‘Kheer’ for the Lord Buddha. Some of the activities, such as Buddha scriptures recitations, prayer meetings, and many more, are observed at the festival. Also, meditation performed on the eve of Buddha Purnima. Everyone remembered the teachings of Lord Buddha, and they offer ‘Kheer’ to the Statue of the Buddha. Some countries such as Malaysia, Japan, China, etc. celebrate Buddha Purnima festival in their traditional way.",
      "url": "https://d2xsikgwxkxyoe.cloudfront.net/media/48469/thumbnail-may-2021-25.jpg"
    },
    {
      "date": "09-07",
      "day": "Saturday",
      "holiday": "Eid-ul-Azha",
      "type": "Notional holiday",
      "comment": "Eid-Al-Adha is one of the major festivals of Islam. Annually, people celebrate it with devotion and prayers. The fest remembers Ibrahim’s sacrifice of his son as per God’s order. Allah pleased with his dedication and sacrifice and replaced his son with a lamb.\n\nThe fest of Eid-Al-Adha is celebrated by sacrificing animals and preparing food from their meat. In Middle Eastern countries, the charm of Eid-Al-Adha can be seen on a huge level. In India, politicians and other famous faces with the general public and feast are also organized.\n\nIn Middle Eastern countries special Ma’amoul (sweet dish) are prepared on the occasion of Edi-Al-Adha. Muslims put on their best clothes. The slaughtered animals are called adhiya. On this day millions of animals are sacrificed for the Eid-Al-Adha special feast. The domestic animals are used for Halal. Cattle like goat, lamb, cow, camel, and sheep are domesticated by people.\n\nThe traditional Muslim families hire a special keeper to take care of their cattle and care for them as their family. On the eve of Eid-Al-Adha, they sacrifice them as devotion towards Allah. The sacrifice of Ibrahim is a message that strongly says that God is great and one can sacrifice his most precious thing for him.\n\n",
      "url": "https://cdn4.vectorstock.com/i/1000x1000/23/68/eid-al-adha-greeting-card-with-goat-sheep-cow-vector-35272368.jpg"
    },
    {
      "date": "10-07",
      "day": "Sunday",
      "holiday": "Eid-ul-Azha",
      "type": "Notional holiday",
      "comment": "Eid-Al-Adha is one of the major festivals of Islam. Annually, people celebrate it with devotion and prayers. The fest remembers Ibrahim’s sacrifice of his son as per God’s order. Allah pleased with his dedication and sacrifice and replaced his son with a lamb.\n\nThe fest of Eid-Al-Adha is celebrated by sacrificing animals and preparing food from their meat. In Middle Eastern countries, the charm of Eid-Al-Adha can be seen on a huge level. In India, politicians and other famous faces with the general public and feast are also organized.\n\nIn Middle Eastern countries special Ma’amoul (sweet dish) are prepared on the occasion of Edi-Al-Adha. Muslims put on their best clothes. The slaughtered animals are called adhiya. On this day millions of animals are sacrificed for the Eid-Al-Adha special feast. The domestic animals are used for Halal. Cattle like goat, lamb, cow, camel, and sheep are domesticated by people.\n\nThe traditional Muslim families hire a special keeper to take care of their cattle and care for them as their family. On the eve of Eid-Al-Adha, they sacrifice them as devotion towards Allah. The sacrifice of Ibrahim is a message that strongly says that God is great and one can sacrifice his most precious thing for him.\n\n",
      "url": "https://i.pinimg.com/originals/a7/9d/f7/a79df7e2e4d53d80f79550635a5ea4f3.jpg"
    },
    {
      "date": "11-07",
      "day": "Monday",
      "holiday": "Eid-ul-Azha",
      "type": "Notional holiday",
      "comment": "Eid-Al-Adha is one of the major festivals of Islam. Annually, people celebrate it with devotion and prayers. The fest remembers Ibrahim’s sacrifice of his son as per God’s order. Allah pleased with his dedication and sacrifice and replaced his son with a lamb.\n\nThe fest of Eid-Al-Adha is celebrated by sacrificing animals and preparing food from their meat. In Middle Eastern countries, the charm of Eid-Al-Adha can be seen on a huge level. In India, politicians and other famous faces with the general public and feast are also organized.\n\nIn Middle Eastern countries special Ma’amoul (sweet dish) are prepared on the occasion of Edi-Al-Adha. Muslims put on their best clothes. The slaughtered animals are called adhiya. On this day millions of animals are sacrificed for the Eid-Al-Adha special feast. The domestic animals are used for Halal. Cattle like goat, lamb, cow, camel, and sheep are domesticated by people.\n\nThe traditional Muslim families hire a special keeper to take care of their cattle and care for them as their family. On the eve of Eid-Al-Adha, they sacrifice them as devotion towards Allah. The sacrifice of Ibrahim is a message that strongly says that God is great and one can sacrifice his most precious thing for him.\n\n",
      "url": "https://cdn4.vectorstock.com/i/1000x1000/23/68/eid-al-adha-greeting-card-with-goat-sheep-cow-vector-35272368.jpg"
    },
    {
      "date": "09-08",
      "day": "Tuesday",
      "holiday": "Muharram (Ashura)",
      "type": "Notional holiday",
      "comment": "Muharram is one of the religious festivals of the Muslim community. Muharram is the first month of the Islamic Hijri calendar. It is said as one of the sacred months in which fighting is prohibited. As per the Gregorian calendar, every year Muharram is celebrated on different dates.\n\nShia Muslim community fast for ten days and on the eleventh day, they mourn for the demise of Imam Hussein. As per the Sunni Muslim community, Muharram marks for the day when Moses had conquers over the Egyptian Pharaoh (King) with his disciples. As per the Islamic belief, Prophet Muhammad was asked all the Muslim community to have fast in these eleven days.\n\nSome of the Muslim communities prepare sweet rice and share it with their family, friends, etc. Muharram means banned or prohibited. Muslim beliefs that in the month of Muharram almighty forgive the warfare. The tenth day of Muharram is called the Day of Ashura.",
      "url": "https://images.news18.com/ibnlive/uploads/2021/08/muharram1.jpg?impolicy=website&width=0&height=0"
    },
    {
      "date": "18-08",
      "day": "Thursday",
      "holiday": "Janmashtami",
      "type": "Notional holiday",
      "comment": "Janmashtami, also known as “Sri Krishna Jayanti” is one of the most famous and holiest festival celebrated amongst the Hindus and the dedicated devotees of Lord Krishna. Janmashtami is celebrated to mark the birth anniversary of Krishna and is celebrated on the eighth day of Krishna Paksha according to the Hindu calendar.\n\nJanmashtami has various other names like Krishnashtami, Gokulashtami, and Srijayanti and the festival is celebrated much great joy and enthusiasm.\n\nA famous game that is played on the auspicious occasion of Janmashtami is DahiHandi and is mainly played in Maharashtra. The Janmashtami of Vrindavan and Mathura, where Lord Krishna had spent most of his childhood, is world-famous and is celebrated with great endeavour.\n\nStudents can also get Janmashtami Essay and Essay on Krishna Janmashtami from here.\n\nThere are specific rituals that the devotees follow on this day, like the festival of Janmashtami is preceded by a day-long fast that is broken at midnight. Traditional dance and devotional songs make the festival even more special.",
      "url": "https://images.hindustantimes.com/img/2021/08/29/550x309/Janmashtami2_960_(1)_1630234474527_1630234482521.jpg"
    },
    {
      "date": "05-10",
      "day": "Wednesday",
      "holiday": "Durga Puja",
      "type": "Notional holiday",
      "comment": "Durga puja is an ancient Hindu festival. There is a mythological legend behind it. Hindus believe that Goddess Durga was the daughter of Himalaya and Menka. Durga in her one of the incarnations later married Lord Shiva. The festival of Durga puja is believed to have started when Lord Rama worshipped the goddess for her blessings and power to kill Ravana.\n\nSome people believe that it is on the day that Durga killed the demon Mahishasura. She was requested by the three gods – Brahma, Vishnu, and Mahesh to save the world from atrocities of Mahishasura. The fight lasted for 10 days and Mahishasura was killed on the last day. Therefore, we celebrate the 10th day as Vijayadashmi or Dussehra.\n\nDuring the festival, the devotees worship the goddess in several different forms. Large pandals with the idols of the goddess are erected at several places. Daily aarti (veneration) is performed of the idols from the sixth to the ninth day. The pandals become a center of cultural and religious activities.\n\nPeople of West Bengal perform a folk dance in front of the goddess, holding burning camphor in clay pots in their hands. It is performed amid the beating of drums. People belonging to all classes of society celebrate Durga puja irrespective of their social or financial status.",
      "url": "https://images.news18.com/ibnlive/uploads/2021/10/happy-durga-puja-1.jpg?impolicy=website&width=0&height=0"
    },
    {
      "date": "09-10",
      "day": "Sunday",
      "holiday": "Eid-e-Miladun-Nabi (Sm)",
      "type": "Notional holiday",
      "comment": "Eid-e-Miladdun-nabi is popularly known as Barah Wafat. It is celebrated on the twelfth day of the third month of Islamic calendar, Rabi-ul-Awwal. It is celebrated to commemorate the birthday of the Prophet Mohammad. On this day special prayers are held in mosques. Islamic scholars deliver sermons largely focussing on the life, teaching and noble deeds of the Prophet. Elegies or marsiyas are sung in memory of the last days of the Prophet. In some parts is observed and alms-giving is a common practice in this festival.",
      "url": "https://assets.thehansindia.com/h-upload/2020/10/26/1007604-eid.webp"
    },
    {
      "date": "16-12",
      "day": "Friday",
      "holiday": "Victory Day",
      "type": "Notional holiday",
      "comment": "The 16th of December is the Victory Day of Bangladesh. It is the most memorable day in the history of our country. After a nine-month-long bloody battle, we won the victory on this day. The Pakistani Army was compelled to surrender. Bangladesh occupied a place in the world map as an independent country. Every year we observe this day with due solemnity. We remember the supreme sacrifice of the patriotic heroic sons who laid down their lives for the country and we pay glowing tribute to their departed soul. The day begins with gunshots. The whole country puts on a festive look. The national flag is hoisted on the top of each house and office. The whole atmosphere is resounded with Bangabandhu’s fiery speech of the March and the patriotic songs. The armed forces of the country organize special parades and gun-shots. The Prime Minister and the President took salute from them. Political leaders and people, in general, visit the National Monument at Savar. They offer flowers there to show their heartfelt love for the heroic sons who died for the cause of freedom. Meetings, seminars, symposiums, and discussions are held on this day by different govt. and non-govt. organizations. This day is a day of great joy, hope, and inspiration. This victory symbolizes a victory against injustice, tyranny, and falsehood. This day will remain ever fresh and evergreen in the heart of each and every Bangladeshi.",
      "url": "https://www.newagebd.com/files/records/news/202012/124498_158.jpg"
    },
    {
      "date": "25-12",
      "day": "Sunday",
      "holiday": "Christmas Day",
      "type": "Notional holiday",
      "comment": "Christmas is a termination event of a 12-day long festival. Many people don’t know the preceding events and only focus on the main festival. The 12 days of Christmas are all about fasting and penance to commemorate the suffering faced by Jesus.\n\nThe last day of the 12-day series is known as Christmas and is celebrated on December 25 every year. It falls on the winter solstice day in the Roman calendar and is the darkest day of the year. The birth of Jesus comes as a ray of hope and marks the beginning of a journey towards enlightenment. Christmas is all about decorating Christmas trees, eating with families and friends, and having lots of fun. The core values of sharing are instilled in children from the beginning, and they learn to have a deep sense of moral values.\n\nChristmas shouldn’t be used only to have fun. It is the time when we should think about the plight of those people who are less fortunate than us. It is the time when charity works are organized all across the globe, and the revenues generated from them are used for the betterment of the poor and the needy. People use this time to reconnect with their family and friends over a delicious dinner; they play games and give them gifts. This fosters the familial ties between people and makes them happier and joyful.",
      "url": "https://www.awarenessdays.com/wp-content/uploads/2018/07/christmas_day_hd_wallpaper.jpg"
    }
  ]
}